#pragma once
#include <AbstractApp.h>


//{----------------------------------------------------------------------------------------------------------------
//! @ingroup UI
//! @brief   Класс наследник AbstractAppData, класс управляющий окном приложения
//!
//!
//! @see     AbstractAppData
//!
//! @usage @code
//! GraphicEngine* graphicEngine = new GraphicEngine();
//! graphicEngine->startApp();
//! @endcode
//}----------------------------------------------------------------------------------------------------------------
struct GraphicEngine : AbstractAppData
{
    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Размер главной области экрана(области решающей системы), по совместительству минимальный размер окна
    //!
    //!
    //! @see     Vector
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    const Vector SOLUTIONWINDOWSIZE = { 1000, 225 };

    GraphicEngine();

    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Вызывается при начале работы цикла окна, тут создаются все окна приложения
    //!
    //! @param   window   Дескриптор окна
    //! @param   message  WM_MESSAGE
    //! @param   wParam   Параметры сообщения
    //! @param   lParam   Параметры сообщения
    //!
    //! @see     AbstractAppData
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    virtual void onCreate(HWND window, UINT message, WPARAM wParam, LPARAM lParam) override;
};