#pragma once
#include <LinearLayout.h>

//{----------------------------------------------------------------------------------------------------------------
//! @ingroup UI
//! @brief   LinearLayout, который постоянно себя помещает в центр экрана
//!
//!
//! @see     LinearLayout
//! @endcode
//}----------------------------------------------------------------------------------------------------------------
struct MainLayout : LinearLayout
{
    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Конструктор MainLayout
    //!
    //! @param   _app       Ссылка на управляющий класс
    //! @see     AbstractAppData
    //! 
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    MainLayout(AbstractAppData* _app) :
        LinearLayout(_app, {}, LinearLayout::FLAG_VERTICAL)
    {}

    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Данная функция вызывается при изменении размеров приложения или при необходимости изменить расположение дочерних окон
    //!
    //! @param   managerSize       Размер более старшего окна, поскольку его нет, то это размер приложения
    //! @param   _newRect          Желаемый размер данной менеджера, в большинстве случаев просто {}
    //!
    //! @return  0
    //!
    //!
    //! @usage @code
    //! appData->mainManager->onSize(appData->systemSettings->SizeOfScreen);
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    virtual int onSize(Vector managerSize, Rect _newRect = {}) override;
};