#pragma once


//{----------------------------------------------------------------------------------------------------------------
//! @ingroup SolutionSystem
//! @brief   Класс числа
//!
//! @usage @code
//! Number a, b, c;
//! a.num = _a;
//! b.num = _b;
//! c.num = _c;
//! Number solutions[2] = {};
//! int length = solveExpression(a, b, c, solutions);
//! @endcode
//}----------------------------------------------------------------------------------------------------------------
struct Number
{
    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup SolutionSystem
    //! @brief   Число в виде double
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    double num;
    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup SolutionSystem
    //! @brief   Длина строки создаваемой и возвращаемой в toString
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    static const int stringNumberSize = 200;

    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup SolutionSystem
    //! @ingroup SolutionSystem
    //! @brief   Конвертирует класс(число) в строку
    //!
    //! @see     unitTest()
    //! 
    //! @return  Статическая строка из char длиной stringNumberSize
    //!
    //! @usage @code
    //! Number d = {};
    //! d.num = 52;
    //! printf("%s", d.toString());
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    const char* toString();
};
