#pragma once
#include <WindowsLib.h>
#include <LinearLayout.cpp>
#include <DoubleInputButton.cpp>
#include <InputButton2.cpp>
#include <TextView.cpp>
#include <MessageButton.cpp>
#include "Number.h"


//{----------------------------------------------------------------------------------------------------------------
//! @ingroup UI
//! @brief   Окно решающей системы
//!
//! @see     Manager
//! @endcode
//}----------------------------------------------------------------------------------------------------------------
struct SolutionWindow : Manager
{
    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Главный вертикальный LinearLayout
    //!
    //! @see     LinearLayout
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    LinearLayout mainLayout;

    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Горизонтальный LinearLayout, где размещены окна введения ответа
    //!
    //! @see     LinearLayout
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    LinearLayout inputLayout;

    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Поле с информированием о программе
    //!
    //! @see     TextView
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    TextView textWindow;

    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Окно для введения коэффициента a
    //!
    //! @see     DoubleInputButton
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    DoubleInputButton aButton;

    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Окно для показа x^2
    //!
    //! @see     TextView
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    TextView aView;

    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Коэффициент a
    //!
    //! @see     TextView
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    double a = 0;

    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Окно для введения коэффициента b
    //!
    //! @see     DoubleInputButton
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    DoubleInputButton bButton;

    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Окно для показа x
    //!
    //! @see     TextView
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    TextView bView;

    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Коэффициент b
    //!
    //! @see     TextView
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    double b = 0;

    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Окно для введения коэффициента c
    //!
    //! @see     DoubleInputButton
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    DoubleInputButton cButton;

    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Коэффициент c
    //!
    //! @see     TextView
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    double c = 0;

    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Кнопка начала вычислений
    //!
    //! @see     MessageButton
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    MessageButton calcButton;

    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Ключ для сообщения, посылаемого в это окно для старта решения уравнения
    //!
    //! @see     MessageButton
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    const char* solute = "solute";


    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Поле для вывода ответов
    //!
    //! @see     TextView
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    TextView solutions;

    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Минимальное значение для коэффицентов
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    double minLimit = DBL_MIN;

    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Максимальное значение для коэффицентов
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    double maxLimit = DBL_MAX;

    struct LocalStringResources
    {
        static const inline std::string enterCoef = "enterCoef";
        static const inline std::string solute = "solute";
        static const inline std::string noSolutions = "noSol";
        static const inline std::string error = "errorSolWindow";
        static const inline std::string solutions = "solutions";
    };


    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Конструктор SolutionWindow
    //!
    //! @param   _app       Ссылка на управляющий класс
    //! @param   size       Размер окна с рещающей системой
    //! 
    //! @see     AbstractAppData
    //! 
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    SolutionWindow(AbstractAppData* _app, Vector _size) :
        Manager(_app),
        mainLayout(app, {}, LinearLayout::FLAG_VERTICAL),
        inputLayout(app, {}, LinearLayout::FLAG_HORIZONTAL),
        aButton(app, {}, &a, &minLimit, &maxLimit, DoubleInputButton::STANDART_MODE, app->systemSettings->MenuColor),
        bButton(app, {}, &b, &minLimit, &maxLimit, DoubleInputButton::STANDART_MODE, app->systemSettings->MenuColor),
        cButton(app, {}, &c, &minLimit, &maxLimit, DoubleInputButton::STANDART_MODE, app->systemSettings->MenuColor),
        aView (app, 0, "x^2 + "),
        bView (app, 0, "x + "),
        calcButton(app),
        solutions(app),
        textWindow(app, app->systemSettings->MainFont * 3)
    {
        resize(_size);
        addWindow(mainLayout);

        initStrings();

        textWindow.setText(getApp().getStringResources().getCResource(LocalStringResources::enterCoef));
        textWindow.setWrapStatusY(1);
        mainLayout.addWindow(textWindow);
        mainLayout.addWindow(inputLayout);
        inputLayout.addWindow(aButton);
        inputLayout.addWindow(aView);
        inputLayout.addWindow(bButton);
        inputLayout.addWindow(bView);
        inputLayout.addWindow(cButton);
        calcButton.setReciever(this);
        calcButton.setMessage(solute, NULL);
        mainLayout.addWindow(calcButton);
        mainLayout.addWindow(solutions);
    }

    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Нормализует ответы полученные решающей системой
    //! 
    //! @param answers Ответы
    //! @param length  Количество ответов
    //!
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    void setAnswer(Number answers[2], int length);

    void initStrings();


    //{----------------------------------------------------------------------------------------------------------------
   //! @ingroup UI
   //! @brief   Данная функция вызывается при изменении размеров приложения или при необходимости изменить расположение дочерних окон
   //!
   //! @param   managerSize       Размер более старшего окна, поскольку его нет, то это размер приложения
   //! @param   _newRect          Желаемый размер данной менеджера, в большинстве случаев просто {}
   //!
   //! @return  0
   //!
   //!
   //! @usage @code
   //! appData->mainManager->onSize(appData->systemSettings->SizeOfScreen);
   //! @endcode
   //}----------------------------------------------------------------------------------------------------------------
    virtual int onSize(Vector managerSize, Rect newRect = {});

    //{----------------------------------------------------------------------------------------------------------------
    //! @ingroup UI
    //! @brief   Вызывается при получении соообщеия
    //! 
    //! @param name Ключ сообщения
    //! @param data Прочие данные соощения
    //!
    //! @endcode
    //}----------------------------------------------------------------------------------------------------------------
    virtual void onMessageRecieve(const char* name, void* data) override;
};